БукмекерскаяКонтора/src/Documents/Ставка/Ставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Ставка</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исход</name>
    <type>
      <types>CatalogRef.Исходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусСтавки</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/Enums/СтатусСтавки/СтатусСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусСтавки</name>
  <enumValues>
    <name>Записано</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>Выиграно</name>
  </enumValues>
  <enumValues>
    <name>Проиграно</name>
  </enumValues>
</mdclass:Enum>

БукмекерскаяКонтора/src/Catalogs/Исходы/Исходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Исходы</name>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

БукмекерскаяКонтора/src/Documents/Ставка/Forms/Создать/Module.bsl
&НаКлиенте
Процедура МероприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МероприятиеНачалоВыбораНаСервере(ДанныеВыбора);
КонецПроцедуры

&НаСервере
Процедура МероприятиеНачалоВыбораНаСервере(ДанныеВыбора)
	ДанныеВыбора = Новый СписокЗначений();
	
	Запрос = новый Запрос();
	Запрос.Текст = "Выбрать
	|Мероприятие.Ссылка,
	|Мероприятие.Наименование
	|Из
	|Справочник.Мероприятия как Мероприятие
	|Где
	|Мероприятие.Завершено = Ложь";
	Мероприятие = Запрос.Выполнить().Выбрать();
	Пока Мероприятие.Следующий() Цикл
		ДанныеВыбора.Добавить(Мероприятие.Ссылка, Мероприятие.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИсходНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИсходНачалоВыбораНаСервере(ДанныеВыбора);
КонецПроцедуры

&НаСервере
Процедура ИсходНачалоВыбораНаСервере(ДанныеВыбора)
	ДанныеВыбора = Новый СписокЗначений();
	
	Запрос = новый Запрос();
	Запрос.Текст = "Выбрать
	|Исход.Ссылка,
	|Исход.Наименование
	|Из
	|Справочник.Исходы как Исход
	|Где
	|Исход.Дата > &ТекущаяДата И Исход.Мероприятие = &Мероприятие";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Мероприятие", ЭтотОбъект.Объект.Мероприятие);
	Исход = Запрос.Выполнить().Выбрать();
	Пока Исход.Следующий() Цикл
		ДанныеВыбора.Добавить(Исход.Ссылка, Исход.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Мероприятие.Завершено
	Тогда
		Отказ = Истина;
		Сообщить("Нельзя поставить назавершенное мероприятие");
	Иначе
		Если ТекущийОбъект.Исход.Мероприятие <> ТекущийОбъект.Мероприятие
		Тогда
			Отказ = Истина;
			Сообщить("Исход не из выбранного мероприятия");
		Иначе
			Если ТекущийОбъект.Исход.Дата < ТекущаяДата()
			Тогда
				Отказ = Истина;
				Сообщить("Время ставки на исход прошло");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МероприятиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Объект.Исход = Справочники.Исходы.НайтиПоРеквизиту("Мероприятие", ВыбранноеЗначение);
КонецПроцедуры


&НаКлиенте
Процедура ИгрокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.Добавить(ПараметрыСеанса.Игрок);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		Объект.Игрок = ПараметрыСеанса.Игрок;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусСтавки.Записано");
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура();
	Если (Параметры.Свойство("ЗначенияЗаполнения", ДанныеЗаполнения))
	Тогда
		ДанныеЗаполнения.Свойство("Мероприятие", ЭтаФорма.Объект.Мероприятие);
		ДанныеЗаполнения.Свойство("Исход", ЭтаФорма.Объект.Исход);
	КонецЕсли;
КонецПроцедуры
